Revit 2024 API
TextEditorOptions Members
The TextEditorOptions type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the TextEditorOptions
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetTextEditorOptions
 Returns the current Revit instance's TextEditorOptions.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
ShowBorder
 Show the border box around the text during editing.
ShowOpaqueBackground
 Show opaque background behind the text during editing.
See Also
TextEditorOptions Class
Autodesk.Revit.UI Namespace